alibaba/AliOS-Things/platform/mcu/nrf52xxx/Drivers/libraries/usbd/class/msc/app_usbd_msc.c
    return p_msc_ctx->current.blk_datasize > blk_size * blk_cnt ?
           blk_size * blk_cnt : p_msc_ctx->current.blk_datasize;
}

/**
 * @brief SCSI Command: @ref APP_USBD_SCSI_CMD_TESTUNITREADY handle
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_msc         MSC instance
 * @param[in] p_msc_ctx     MSC context
 * @return Standard error code
 * */
static ret_code_t cmd_testunitready(app_usbd_class_inst_t const * p_inst,
                                    app_usbd_msc_t const *        p_msc,
                                    app_usbd_msc_ctx_t *          p_msc_ctx)
{
    NRF_LOG_DEBUG("CMD: TESTUNITREADY");
    if (uint32_decode(p_msc_ctx->cbw.datlen) != 0)
    {
        return status_unsupported_start(p_inst);
    }

    if (p_msc_ctx->cbw.cdb_length != APP_USBD_SCSI_CMD_TESTUNITREADY_LEN)
    {
        return status_unsupported_start(p_inst);
    }

    if (p_msc_ctx->cbw.lun >= p_msc->specific.inst.block_devs_count)
    {
        return status_unsupported_start(p_inst);
    }

    return csw_wait_start(p_inst, APP_USBD_MSC_CSW_STATUS_PASS);
}

/**
 * @brief SCSI Command: @ref APP_USBD_SCSI_CMD_REQUESTSENSE handle
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_msc         MSC instance
 * @param[in] p_msc_ctx     MSC context
 * @return Standard error code
 * */
static ret_code_t cmd_requestsense(app_usbd_class_inst_t const * p_inst,
                                   app_usbd_msc_t const *        p_msc,
                                   app_usbd_msc_ctx_t *          p_msc_ctx)
{
    NRF_LOG_DEBUG("CMD: REQUESTSENSE");
    app_usbd_scsi_cmd_requestsense_t const * p_reqs =  (const void *)p_msc_ctx->cbw.cdb;
    UNUSED_VARIABLE(p_reqs);

    if ((p_msc_ctx->cbw.cdb_length < sizeof(app_usbd_scsi_cmd_requestsense_t)))
    {
        return status_unsupported_start(p_inst);
    }

    if (p_msc_ctx->cbw.lun >= p_msc->specific.inst.block_devs_count)
    {
        return status_unsupported_start(p_inst);
    }

    p_msc_ctx->resp_len = uint32_decode(p_msc_ctx->cbw.datlen);
    p_msc_ctx->resp_len = MIN(p_msc_ctx->resp_len,
                              sizeof(app_usbd_scsi_cmd_requestsense_resp_t));

    if (p_msc_ctx->resp_len == 0)
    {
        return csw_wait_start(p_inst, APP_USBD_MSC_CSW_STATUS_PASS);
    }

    memset(&p_msc_ctx->scsi_resp, 0, sizeof(app_usbd_scsi_cmd_requestsense_resp_t));
    p_msc_ctx->scsi_resp.requestsense.code = APP_USBD_SCSI_CMD_REQSENSE_CODE_VALID |
                                             APP_USBD_SCSI_CMD_REQSENSE_CODE_CURRENT;

    p_msc_ctx->scsi_resp.requestsense.len = sizeof(app_usbd_scsi_cmd_requestsense_resp_t) -
                                            offsetof(app_usbd_scsi_cmd_requestsense_resp_t, len);

    return transfer_in_start(p_inst,
                             &p_msc_ctx->scsi_resp,
                             p_msc_ctx->resp_len,
                             APP_USBD_MSC_STATE_CMD_IN);
}


/**
 * @brief SCSI Command: @ref APP_USBD_SCSI_CMD_FORMAT_UNIT handle
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_msc         MSC instance
 * @param[in] p_msc_ctx     MSC context
 * @return Standard error code
 * */
static ret_code_t cmd_formatunit(app_usbd_class_inst_t const * p_inst,
                                 app_usbd_msc_t const *        p_msc,
                                 app_usbd_msc_ctx_t *          p_msc_ctx)
{
    NRF_LOG_DEBUG("CMD: FORMAT_UNIT");
    return status_unsupported_start(p_inst);
}

static ret_code_t cmd_read_start(app_usbd_class_inst_t const * p_inst,
                                 app_usbd_msc_t const *        p_msc,
                                 app_usbd_msc_ctx_t *          p_msc_ctx)
{
    nrf_block_dev_t const * p_blkd = p_msc->specific.inst.pp_block_devs[p_msc_ctx->cbw.lun];

    p_msc_ctx->current.trans_in_progress = false;
    p_msc_ctx->current.req_busy_mask = 0;
    p_msc_ctx->current.workbuff_pos = 0;

    APP_USBD_MSC_REQ_BUSY_SET(p_msc_ctx->current.req_busy_mask, 0);
    NRF_BLOCK_DEV_REQUEST(req,
                          p_msc_ctx->current.blk_idx,
                          p_msc_ctx->current.blk_count,
                          ((uint8_t *)p_msc->specific.inst.p_block_buff +
                          p_msc_ctx->current.workbuff_pos));

    NRF_LOG_DEBUG("cmd_read_start");
    NRF_LOG_DEBUG("nrf_blk_dev_read_req 1: id: %u, count: %u, left: %u, ptr: %p",
                  req.blk_id,
                  req.blk_count,
                  p_msc_ctx->current.blk_datasize,
                  (uint32_t)req.p_buff);

    ret_code_t ret = nrf_blk_dev_read_req(p_blkd, &req);
    NRF_LOG_DEBUG("nrf_blk_dev_read_req 1: ret: %u", ret);

    return ret;
}

/**
 * @brief SCSI Command: @ref APP_USBD_SCSI_CMD_READ6 handle
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_msc         MSC instance
 * @param[in] p_msc_ctx     MSC context
 * @return Standard error code
 * */
static ret_code_t cmd_read6(app_usbd_class_inst_t const * p_inst,
                            app_usbd_msc_t const *        p_msc,
                            app_usbd_msc_ctx_t *          p_msc_ctx)
{
    NRF_LOG_DEBUG("CMD: READ6");
    app_usbd_scsi_cmd_read6_t const * p_read6 = (const void *)p_msc_ctx->cbw.cdb;
    if (p_msc_ctx->cbw.cdb_length < sizeof(app_usbd_scsi_cmd_read6_t))
    {
        return status_unsupported_start(p_inst);
    }

    if (p_msc_ctx->cbw.lun >= p_msc->specific.inst.block_devs_count)
    {
        return status_unsupported_start(p_inst);
    }

    nrf_block_dev_t const * p_blkd = p_msc->specific.inst.pp_block_devs[p_msc_ctx->cbw.lun];

    p_msc_ctx->current.lun = p_msc_ctx->cbw.lun;
    p_msc_ctx->current.blk_idx = ((p_read6->mslba & 0x1F) << 16) |
                                   uint16_big_decode(p_read6->lslba);
    p_msc_ctx->current.blk_datasize = uint32_decode(p_msc_ctx->cbw.datlen);
    p_msc_ctx->current.blk_size = nrf_blk_dev_geometry(p_blkd)->blk_size;
    p_msc_ctx->current.blk_count = next_transfer_blkcnt_calc(p_msc, p_msc_ctx);

